[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPage.js:24:34
     },
   });
 
-  const onSuccess = (section) => {
-    console.log();
-    setSectionJSON(section);
-  };
+  const onSuccess = (section) => {};
 
   const mutation = useBackendMutation(
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/SectionSearches/SectionSearchesIndexPage.js:55:39
     [],
   );
 
-  const objectToAxiosParamsSubjects = () => ({
-    url: "/api/UCSBSubjects/load",
-    method: "POST",
-  });
+  const objectToAxiosParamsSubjects = () => undefined;
 
   var subjectsCount = subjects.length;
killedBy: Section Searches Index Page tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/SectionSearches/SectionSearchesIndexPage.js:57:13
 
   const objectToAxiosParamsSubjects = () => ({
     url: "/api/UCSBSubjects/load",
-    method: "POST",
+    method: "",
   });
 
killedBy: Section Searches Index Page tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPage.js:62:43
 
   var subjectsCount = subjects.length;
 
-  const onSuccessSubjects = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
-    subjectsCount = subjects.length;
-  };
+  const onSuccessSubjects = (subjects) => {};
 
   const mutationSubjects = useBackendMutation(
killedBy: Section Searches Index Page tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Number of Subjects Loaded : 3"

Number of calls: 0

[Survived] ArithmeticOperator
main/pages/SectionSearches/SectionSearchesIndexPage.js:63:42
   var subjectsCount = subjects.length;
 
   const onSuccessSubjects = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
+    toast(`Number of Subjects Loaded : ${subjects.length + subjectsCount}`);
     subjectsCount = subjects.length;
   };

[Killed] StringLiteral
main/pages/SectionSearches/SectionSearchesIndexPage.js:63:11
   var subjectsCount = subjects.length;
 
   const onSuccessSubjects = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
+    toast(``);
     subjectsCount = subjects.length;
   };
killedBy: Section Searches Index Page tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Number of Subjects Loaded : 3"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPage.js:73:19
     // Stryker disable next-line all : hard to set up test for caching
     ["/api/UCSBSubjects/all"],
   );
-  useEffect(() => {
-    // Fetch subjects when the component mounts
-    mutationSubjects.mutate();
-  }, []);
+  useEffect(() => {}, []);
 
 
killedBy: Section Searches Index Page tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Survived] ArrayDeclaration
main/pages/SectionSearches/SectionSearchesIndexPage.js:76:6
   useEffect(() => {
     // Fetch subjects when the component mounts
     mutationSubjects.mutate();
-  }, []);
+  }, ["Stryker was here"]);
 
 
