[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.js:12:5
 
 export default function PersonalSectionsTable({ details }) {
   const columns = [
-    {
-      Header: "Course ID",
-      accessor: "courseId",
-    },
+    {},
     {
       Header: "Enroll Code",
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.js:13:15
 export default function PersonalSectionsTable({ details }) {
   const columns = [
     {
-      Header: "Course ID",
+      Header: "",
       accessor: "courseId",
     },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.js:16:5
       Header: "Course ID",
       accessor: "courseId",
     },
-    {
-      Header: "Enroll Code",
-      accessor: "classSections[0].enrollCode",
-    },
+    {},
     {
       Header: "Section",
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:30:17
     },
     {
       Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(
-          row.classSections[0].enrolledTotal,
-          row.classSections[0].maxEnroll,
-        ),
+      accessor: () => undefined,
       id: "enrolled",
     },
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: 19/24. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.js:35:11
           row.classSections[0].enrolledTotal,
           row.classSections[0].maxEnroll,
         ),
-      id: "enrolled",
+      id: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-enrolled"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:39:17
     },
     {
       Header: "Location",
-      accessor: (row) => formatLocation(row.classSections[0].timeLocations),
+      accessor: () => undefined,
       id: "location",
     },
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: LIB 1312. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.js:42:5
       accessor: (row) => formatLocation(row.classSections[0].timeLocations),
       id: "location",
     },
-    {
-      Header: "Days",
-      accessor: "classSections[0].timeLocations[0].days",
-    },
+    {},
     {
       Header: "Time",
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:48:17
     },
     {
       Header: "Time",
-      accessor: (row) => formatTime(row.classSections[0].timeLocations),
+      accessor: () => undefined,
       id: "time",
     },
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:53:17
     },
     {
       Header: "Instructor",
-      accessor: (row) => formatInstructors(row.classSections[0].instructors),
+      accessor: () => undefined,
       id: "instructor",
     },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  WANG L C
Received:

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.js:54:11
     {
       Header: "Instructor",
       accessor: (row) => formatInstructors(row.classSections[0].instructors),
-      id: "instructor",
+      id: "",
     },
   ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-instructor"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
