[Killed] ObjectLiteral
src/main/pages/AdminLoadSubjectsPage.js:21:46
     [],
   );
 
-  const objectToAxiosParamsSubjects = () => ({
-    url: "/api/UCSBSubjects/load",
-    method: "POST",
-  });
+  const objectToAxiosParamsSubjects = () => ({});
 
   var subjectsCount = subjects.length;
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminLoadSubjectsPage.js:22:10
   );
 
   const objectToAxiosParamsSubjects = () => ({
-    url: "/api/UCSBSubjects/load",
+    url: "",
     method: "POST",
   });
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Number of Subjects Loaded : 3"
Received
       1: "useBackendMutation: Error communicating with backend via post on "
       2: "useBackendMutation: Error communicating with backend via post on "

Number of calls: 2

[Killed] BlockStatement
src/main/pages/AdminLoadSubjectsPage.js:28:43
 
   var subjectsCount = subjects.length;
 
-  const onSuccessSubjects = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
-    console.log(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
-
-    subjectsCount = subjects.length;
-  };
+  const onSuccessSubjects = (subjects) => {};
 
   const mutationSubjects = useBackendMutation(
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Number of Subjects Loaded : 3"

Number of calls: 0

[Survived] ArithmeticOperator
src/main/pages/AdminLoadSubjectsPage.js:30:48
 
   const onSuccessSubjects = (subjects) => {
     toast(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
-    console.log(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
+    console.log(`Number of Subjects Loaded : ${subjects.length + subjectsCount}`);
 
     subjectsCount = subjects.length;

[Killed] BlockStatement
src/main/pages/AdminLoadSubjectsPage.js:46:36
     mutationSubjects.mutate();
   }, []);
 
-  const onSubmit = async (data) => {
-    mutationSubjects.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   return (
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally 3 subjects, load nothing
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Number of Subjects Loaded : -3"
Received: "Number of Subjects Loaded : 0"

Number of calls: 1
