[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPage.js:62:43
 
   var subjectsCount = subjects.length;
 
-  const onSuccessSubjects = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
-    console.log(`Number of Subjects Loaded : ${subjects.length - subjectsCount}`);
-    subjectsCount = subjects.length;
-  };
+  const onSuccessSubjects = (subjects) => {};
 
   const mutationSubjects = useBackendMutation(
killedBy: Section Searches Index Page tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Number of Subjects Loaded : 3"

Number of calls: 0
