[Killed] ArrowFunction
src/main/utils/sectionUtils.js:98:31
   }
 };
 
-export const formatInfoLink = (row) =>
-  `/coursedetails/${yyyyqToQyy(row.courseInfo.quarter)}/${
-    row.section.enrollCode
-  }`;
+export const formatInfoLink = () => undefined;
 
 export const renderInfoLink = ({ cell: { value } }) => (
killedBy: Section tests Info link is correct
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
