[Killed] EqualityOperator
main/components/Courses/CourseForm.js:40:22
   // Stryker restore all
 
   useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
+    if (schedules && schedules.length >= 0 && !localSchedule) {
       setSchedule(schedules[0].id);
       // Stryker disable all : not sure how to test/mock local storage
killedBy: CoursesCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Courses/CourseForm.js:40:9
   // Stryker restore all
 
   useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
+    if (true) {
       setSchedule(schedules[0].id);
       // Stryker disable all : not sure how to test/mock local storage
killedBy: CourseForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
