[Killed] ObjectLiteral
main/components/Jobs/TestJobForm.js:5:25
 import { useForm } from "react-hook-form";
 
 function TestJobForm({ submitAction }) {
-  const defaultValues = {
-    fail: false,
-    sleepMs: 1000,
-  };
+  const defaultValues = {};
 
   // Stryker disable all
killedBy: TestJobsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveValue(1000)

Expected the element to have value:
  1000
Received:
  null

[Killed] StringLiteral
main/components/Jobs/TestJobForm.js:38:24
         <Form.Label htmlFor="sleepMs">Sleep (milliseconds)</Form.Label>
         <Form.Control
           id="sleepMs"
-          data-testid={`${testid}-sleepMs`}
+          data-testid={``}
           type="number"
           step="100"
killedBy: AdminJobsPage tests user can submit a test job
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="TestJobForm-sleepMs"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
main/components/Jobs/TestJobForm.js:43:28
           step="100"
           isInvalid={!!errors.sleepMs}
           {...register("sleepMs", {
-            valueAsNumber: true,
+            valueAsNumber: false,
             required: "sleepMs is required (0 is ok)",
             min: { value: 0, message: "sleepMs must be positive" },
killedBy: TestJobsForm tests submits the form with a number for sleepMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"sleepMs": 5000}, Anything

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/Jobs/TestJobForm.js:45:18
           {...register("sleepMs", {
             valueAsNumber: true,
             required: "sleepMs is required (0 is ok)",
-            min: { value: 0, message: "sleepMs must be positive" },
+            min: {},
             max: {
               value: 60000,
killedBy: TestJobsForm tests rejects sleepMs values below the minimum threshold
statusReason: TypeError: e is not a function

[Killed] StringLiteral
main/components/Jobs/TestJobForm.js:48:24
             min: { value: 0, message: "sleepMs must be positive" },
             max: {
               value: 60000,
-              message: "sleepMs may not be > 60000 (1 minute)",
+              message: "",
             },
           })}
killedBy: TestJobsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: /sleepMs may not be/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
