[Killed] ConditionalExpression
main/components/Jobs/UpdateCoursesByQuarterJobForm.js:23:42
   const localQuarter = localStorage.getItem("BasicSearch.Quarter");
   // Stryker restore all
 
-  const [quarter, setQuarter] = useState(localQuarter || quarters[0].yyyyq);
+  const [quarter, setQuarter] = useState(false);
 
   const handleSubmit = (event) => {
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20211"
Received: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=false"

[Killed] BlockStatement
main/components/Jobs/UpdateCoursesByQuarterJobForm.js:25:35
 
   const [quarter, setQuarter] = useState(localQuarter || quarters[0].yyyyq);
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback({ quarter });
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
