[Killed] ArrayDeclaration
main/components/PersonalSchedules/PersonalSchedulesTable.js:42:19
   };
   // Stryker restore all
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Description",
-      accessor: "description",
-    },
-    {
-      Header: "Quarter",
-      accessor: (row, _rowIndex) => yyyyqToQyy(row.quarter),
-      id: "quarter",
-    },
-  ];
+  const columns = [];
 
   const buttonColumns = [
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.js:66:7
   const buttonColumns = [
     ...columns,
     ButtonColumn(
-      "Details",
+      "",
       "primary",
       detailsCallback,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.js:67:7
     ...columns,
     ButtonColumn(
       "Details",
-      "primary",
+      "",
       detailsCallback,
       "PersonalSchedulesTable",
killedBy: UserTable tests Edit button navigates to the details page for Ordinary user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.js:72:18
       "PersonalSchedulesTable",
     ),
     ButtonColumn("Edit", "primary", editCallback, "PersonalSchedulesTable"),
-    ButtonColumn("Delete", "danger", deleteCallback, "PersonalSchedulesTable"),
+    ButtonColumn("", "danger", deleteCallback, "PersonalSchedulesTable"),
   ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
