[Killed] BlockStatement
main/components/UCSBSubjects/UCSBSubjectsTable.js:14:34
 export default function UCSBSubjectsTable({ subjects, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/UCSBSubjects/edit/${cell.row.values.subjectCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBSubjects/edit/GEOG"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:32:5
   };
 
   const columns = [
-    {
-      Header: "SubjectCode",
-      accessor: "subjectCode",
-    },
+    {},
     {
       Header: "SubjectTranslation",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:33:15
 
   const columns = [
     {
-      Header: "SubjectCode",
+      Header: "",
       accessor: "subjectCode",
     },
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: SubjectCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:36:5
       Header: "SubjectCode",
       accessor: "subjectCode",
     },
-    {
-      Header: "SubjectTranslation",
-      accessor: "subjectTranslation",
-    },
+    {},
     {
       Header: "DeptCode",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:41:15
       accessor: "subjectTranslation",
     },
     {
-      Header: "DeptCode",
+      Header: "",
       accessor: "deptCode",
     },
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: DeptCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:49:15
       accessor: "collegeCode",
     },
     {
-      Header: "RelatedDeptCode",
+      Header: "",
       accessor: "relatedDeptCode",
     },
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: RelatedDeptCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:50:17
     },
     {
       Header: "RelatedDeptCode",
-      accessor: "relatedDeptCode",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBSubjectsTable-cell-row-0-col-relatedDeptCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/UCSBSubjects/UCSBSubjectsTable.js:54:17
     },
     {
       Header: "Inactive",
-      accessor: (row) => String(row.inactive),
+      accessor: () => undefined,
       id: "inactive",
     },
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:61:51
 
   const columnsIfAdmin = [
     ...columns,
-    ButtonColumn("Edit", "primary", editCallback, "UCSBSubjectsTable"),
+    ButtonColumn("Edit", "primary", editCallback, ""),
     ButtonColumn("Delete", "danger", deleteCallback, "UCSBSubjectsTable"),
   ];
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBSubjectsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:61:18
 
   const columnsIfAdmin = [
     ...columns,
-    ButtonColumn("Edit", "primary", editCallback, "UCSBSubjectsTable"),
+    ButtonColumn("", "primary", editCallback, "UCSBSubjectsTable"),
     ButtonColumn("Delete", "danger", deleteCallback, "UCSBSubjectsTable"),
   ];
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.js:73:15
     <OurTable
       data={subjects}
       columns={columnsToDisplay}
-      testid={"UCSBSubjectsTable"}
+      testid={""}
     />
   );
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBSubjectsTable-cell-row-0-col-subjectCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
