[Killed] BlockStatement
main/components/Utils/Plaintext.js:5:45
 
 import PlaintextLine from "./PlaintextLine";
 
-export default function Plaintext({ text }) {
-  if (text == null) {
-    return <pre data-testid="plaintext-empty"></pre>;
-  }
-  const textToRender =
-    typeof text === "string" ? text : JSON.stringify(text, null, 2);
-  const [firstLine, ...rest] = textToRender.split("\n");
-  // Stryker disable StringLiteral
-  return (
-    <pre data-testid="plaintext">
-      <span key={"0"}>{firstLine}</span>
-      {rest.map((line, index) => (
-        // Stryker disable next-line ArithmeticOperator : key value is internal to React and not exposed to tests
-        <PlaintextLine key={index + 1} text={line} />
-      ))}
-    </pre>
-  );
-  // Stryker restore StringLiteral
-}
+export default function Plaintext({ text }) {}
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: Plaintext(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
