[Killed] BlockStatement
src/main/utils/useBackend.js:28:74
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData, rest) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
-        console.error(errorMessage);
-        throw e;
-      }
-    },
-    onError: (e) => {
-      const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-      toast(errorMessage, { type: "error" });
-      console.error(errorMessage);
-    },
-    initialData: initialData,
-    ...rest,
-  });
-}
+export function useBackend(queryKey, axiosParameters, initialData, rest) {}
 
 const wrappedParams = async (params) => {
killedBy: CourseOverTimeSearchForm tests renders without crashing
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/useBackend.js:31:26
 export function useBackend(queryKey, axiosParameters, initialData, rest) {
   return useQuery({
     queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
-        console.error(errorMessage);
-        throw e;
-      }
-    },
+    queryFn: async () => {},
     onError: (e) => {
       const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
killedBy: CourseOverTimeSearchForm tests when I select a start quarter, the state for start quarter changes
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/main/utils/useBackend.js:35:19
       try {
         const response = await axios(axiosParameters);
         return response.data;
-      } catch (e) {
-        const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
-        console.error(errorMessage);
-        throw e;
-      }
+      } catch (e) {}
     },
     onError: (e) => {
killedBy: CourseOverTimeSearchForm tests when I select a start quarter, the state for start quarter changes
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/main/utils/useBackend.js:37:37
         return response.data;
       } catch (e) {
         const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
+        toast(errorMessage, { type: "" });
         console.error(errorMessage);
         throw e;
killedBy: utils/useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "useBackend: Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404", {"type": "error"}
Received
       1
          "useBackend: Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404",
          Object {
        -   "type": "erro

[Killed] ObjectLiteral
src/main/utils/useBackend.js:37:29
         return response.data;
       } catch (e) {
         const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
+        toast(errorMessage, {});
         console.error(errorMessage);
         throw e;
killedBy: utils/useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "useBackend: Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404", {"type": "error"}
Received
       1
          "useBackend: Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404",
        - Object {
        -   "type": "erro

[Killed] BlockStatement
src/main/utils/useBackend.js:42:21
         throw e;
       }
     },
-    onError: (e) => {
-      const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-      toast(errorMessage, { type: "error" });
-      console.error(errorMessage);
-    },
+    onError: (e) => {},
     initialData: initialData,
     ...rest,
killedBy: utils/useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] StringLiteral
src/main/utils/useBackend.js:43:28
       }
     },
     onError: (e) => {
-      const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
+      const errorMessage = ``;
       toast(errorMessage, { type: "error" });
       console.error(errorMessage);
killedBy: utils/useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404", {"type": "error"}
Received
       1
          "useBackend: Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404",
          {"type": "error"},
       2

[Killed] ObjectLiteral
src/main/utils/useBackend.js:44:27
     },
     onError: (e) => {
       const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-      toast(errorMessage, { type: "error" });
+      toast(errorMessage, {});
       console.error(errorMessage);
     },
killedBy: utils/useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404", {"type": "error"}
Received
       1
          "useBackend: Error communicating with backend via GET on /api/admin/users: Error: Request failed with status code 404",
          {"type": "error"},
       2

[Killed] BlockStatement
src/main/utils/useBackend.js:62:3
   objectToAxiosParams,
   useMutationParams,
   queryKey = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (error) => {
-      const errorMessage = `useBackendMutation: Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-      toast(errorMessage, { type: "error" });
-    },
-    // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries(queryKey);
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: AdminJobsPage tests user can submit a test job
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] BlockStatement
src/main/utils/useBackend.js:66:25
   const queryClient = useQueryClient();
 
   return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (error) => {
-      const errorMessage = `useBackendMutation: Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-      toast(errorMessage, { type: "error" });
-    },
+    onError: (error) => {},
     // Stryker disable all : Not sure how to set up the complex behavior needed to test this
     onSettled: () => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] StringLiteral
src/main/utils/useBackend.js:67:28
 
   return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
     onError: (error) => {
-      const errorMessage = `useBackendMutation: Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
+      const errorMessage = ``;
       toast(errorMessage, { type: "error" });
     },
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "useBackendMutation: Error communicating with backend via post on /api/ucsbdates/post",
+ "",
  {"type": "error"},

[Killed] ObjectLiteral
src/main/utils/useBackend.js:68:27
   return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
     onError: (error) => {
       const errorMessage = `useBackendMutation: Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-      toast(errorMessage, { type: "error" });
+      toast(errorMessage, {});
     },
     // Stryker disable all : Not sure how to set up the complex behavior needed to test this
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "useBackendMutation: Error communicating with backend via post on /api/ucsbdates/post",
- Object {
-   "type": "error",
