[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.js:57:18
     );
   };
 
-  const testid = "CourseOverTimeInstructorSearchForm";
+  const testid = "";
 
   return (
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseOverTimeInstructorSearchForm-checkbox"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
