[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:24:5
       id: "quarter",
       Cell: ({ cell: { value } }) => value,
     },
-    {
-      Header: "Course ID",
-      accessor: "courseInfo.courseId",
-      disableGroupBy: true,
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
-    },
+    {},
     {
       Header: "Title",
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArithmeticOperator
main/components/Sections/SectionsInstructorTable.js:28:57
       Header: "Course ID",
       accessor: "courseInfo.courseId",
       disableGroupBy: true,
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value.substring(0, value.length + 2),
     },
     {
killedBy: Section tests Has the expected cell values
statusReason: Error: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  CMPSC 130A -1
Received:
  CMPSC 130A -1

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:60:5
       disableGroupBy: true,
       id: "days",
     },
-    {
-      Header: "Time",
-      accessor: (row) => formatTime(row.section.timeLocations),
-      disableGroupBy: true,
-      id: "time",
-    },
+    {},
     {
       Header: "Instructor",
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!
